---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ScaleFailures
source: html/fdb23197-0c8d-25e0-24ce-04fb605c0411.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScaleFailures

Failures about Scale.

## Syntax (C#)
```csharp
public static class ScaleFailures
```